In [1]:
# importing pandas for the notebook
import pandas as pd

#link for the tables
demoLink="https://en.wikipedia.org/wiki/List_of_countries_by_GDP_(nominal)"

# fetching the tables
demodata=pd.read_html(demoLink,header=0,flavor="bs4",attrs={'class':"wikitable"})

In [2]:
demoVars=demodata[0].copy()

In [3]:
# first rows
demoVars.head()

,Country/Territory,Subregion,Region,IMF[1],IMF[1].1,United Nations[12],United Nations[12].1,World Bank[13][14],World Bank[13][14].1
0,Country/Territory,Subregion,Region,Estimate,Year,Estimate,Year,Estimate,Year
1,United States,Northern America,Americas,22939580,2021,20893746,2020,20936600,2020
2,China,Eastern Asia,Asia,16862979,[n 2]2021,14722801,[n 3]2020,14722731,2020
3,Japan,Eastern Asia,Asia,5103110,2021,5057759,2020,4975415,2020
4,Germany,Western Europe,Europe,4230172,2021,3846414,2020,3806060,2020

In [4]:
#column positions to drop
whichToDrop=[1,2,3,4,6,7,8]

#dropping and updating the data frame
demoVars.drop(labels=demoVars.columns[whichToDrop],axis=1,inplace=True)

In [5]:
# first rows
demoVars.head()

   Country/Territory United Nations[12]
0  Country/Territory           Estimate
1      United States           20893746
2              China           14722801
3              Japan            5057759
4            Germany            3846414

In [7]:
demoVars.columns=demoVars.columns.str.replace("United Nations\[12]","GDP(US$Million)",regex=True)

# current colum names
demoVars.columns

Index(['Country/Territory', 'GDP(US$Million)'], dtype='object')

In [8]:

demoVars.head()

   Country/Territory GDP(US$Million)
0  Country/Territory        Estimate
1      United States        20893746
2              China        14722801
3              Japan         5057759
4            Germany         3846414

In [9]:
demoVars.drop([0], axis=0, inplace = True)

In [10]:
demoVars=demoVars.reset_index(drop=True)

In [11]:

demoVars.head()

  Country/Territory GDP(US$Million)
0     United States        20893746
1             China        14722801
2             Japan         5057759
3           Germany         3846414
4    United Kingdom         2764198

In [ ]:
demoVars.to_csv("co2.csv",index=False)

In [12]:
demoVars['GDP(US$Million)'].value_counts()

20893746    1
13812       1
13008       1
12264       1
12641       1
           ..
64740       1
61143       1
70284       1
60259       1
55          1
Name: GDP(US$Million), Length: 213, dtype: int64

In [13]:
demoVars

    Country/Territory GDP(US$Million)
0       United States        20893746
1               China        14722801
2               Japan         5057759
3             Germany         3846414
4      United Kingdom         2764198
..                ...             ...
211          Kiribati             181
212             Palau             264
213             Nauru             135
214        Montserrat              68
215            Tuvalu              55

[216 rows x 2 columns]

In [14]:
demoVars.to_csv("demoVars.csv",index=False)